reddit/app/controllers/users_controller.rb

    def create
        # render :create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "banana"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2022-12-23 17:05:34.655666"], ["updated_at", "2022-12-23 17:05:34.655666"]]

    def edit
        @user = User.find_by(params[:id])
---
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]

    def update
        @user = User.find_by(params[:id])
        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "ana"], ["updated_at", "2022-12-23 18:52:02.456443"], ["id", 1]]