reddit/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @user = User.find_by(params[:id])